<a href="https://colab.research.google.com/github/changsin/Kaggle30Days/blob/main/01.Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<a name="machine-learning-examples"></a>

## Machine Learning Examples

To see end-to-end examples of the interactive machine learning analyses that Colaboratory makes possible, check out these  tutorials using models from [TensorFlow Hub](https://tfhub.dev).

A few featured examples:

- [Retraining an Image Classifier](https://tensorflow.org/hub/tutorials/tf2_image_retraining): Build a Keras model on top of a pre-trained image classifier to distinguish flowers.
- [Text Classification](https://tensorflow.org/hub/tutorials/tf2_text_classification): Classify IMDB movie reviews as either *positive* or *negative*.
- [Style Transfer](https://tensorflow.org/hub/tutorials/tf2_arbitrary_image_stylization): Use deep learning to transfer style between images.
- [Multilingual Universal Sentence Encoder Q&A](https://tensorflow.org/hub/tutorials/retrieval_with_tf_hub_universal_encoder_qa): Use a machine learning model to answer questions from the SQuAD dataset.
- [Video Interpolation](https://tensorflow.org/hub/tutorials/tweening_conv3d): Predict what happened in a video between the first and the last frame.

In [1]:
import pandas as pd

In [35]:
df_data = pd.read_csv('train.csv')
df_data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [72]:
X_data = df_data.drop(columns=['PassengerID', 'Survived', 'Name', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'])
Y_data = df_data['Survived']

median_age=X_data['Age'].median()
X_data['Age'].replace(np.nan,median_age,inplace=True)

train_data['Sex']=train_data['Sex'].map({'female' : 1,'male' : 0}).astype(int)
test_data['Sex']=test_data['Sex'].map({'female' : 1,'male' : 0}).astype(int)

In [73]:
from sklearn.model_selection import train_test_split

X_train, X_test, Y_train, Y_test = train_test_split(X_data, Y_data, test_size=.2, shuffle=False)

In [77]:
X_train.iloc[711]

PassengerId     712
Survived          0
Pclass            1
Sex            male
Age             NaN
Name: 711, dtype: object

In [75]:
Y_train.iloc[-1]

0

In [ ]:
df_data.iloc[711]

In [68]:
[X_train['Sex'] == 'male'

0       True
1      False
2      False
3      False
4       True
       ...
707     True
708    False
709     True
710    False
711     True
Name: Sex, Length: 712, dtype: bool

In [61]:
gender = X_train.Sex.astype('category')

In [63]:
gender

0        male
1      female
2      female
3      female
4        male
        ...
707      male
708    female
709      male
710    female
711      male
Name: Sex, Length: 712, dtype: category
Categories (2, object): ['female', 'male']

In [16]:
gender_submission = pd.read_csv('gender_submission.csv')
gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [30]:
df_test = pd.read_csv('test.csv')
df_test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [71]:
X_test = df_test.drop(columns=['Name', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'])
X_test.head

<bound method NDFrame.head of      PassengerId  Pclass     Sex   Age
0            892       3    male  34.5
1            893       3  female  47.0
2            894       2    male  62.0
3            895       3    male  27.0
4            896       3  female  22.0
..           ...     ...     ...   ...
413         1305       3    male   NaN
414         1306       1  female  39.0
415         1307       3    male  38.5
416         1308       3    male   NaN
417         1309       3    male   NaN

[418 rows x 4 columns]>

In [19]:
gender_submission.shape

(418, 2)

In [78]:
gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [52]:
X_test.head()

     PassengerId  Pclass     Sex   Age  SibSp  Parch      Fare Embarked
712          713       1    male  48.0      1      0   52.0000        S
713          714       3    male  29.0      0      0    9.4833        S
714          715       2    male  52.0      0      0   13.0000        S
715          716       3    male  19.0      0      0    7.6500        S
716          717       1  female  38.0      0      0  227.5250        C

In [26]:
Y_train = df['Survived']

In [ ]:

from sklearn import svm

svm_default = svm.SVC()
svm_default.fit(X_train, Y_train)

preds = svm_default.predict(X)